{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_1",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        1280,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv1d_1_input"
                }
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1d_1",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        1280,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 500,
                    "kernel_size": [
                        128
                    ],
                    "strides": [
                        128
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 500,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 500,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_6",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 500,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_7",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 7,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "name": "max_pooling1d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "strides": [
                        10
                    ],
                    "pool_size": [
                        10
                    ],
                    "padding": "valid",
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_1",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                }
            }
        ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
}